'''
Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки. Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.
'''

s = input('Введите несколько слов через пробемл: ')
print('Список слов: ', s)
ёnew_s = [s]
for i in new_s:
    i1 = i +
print(new_s)